Repository: george-radu-cs/alfie-client
Catalog: lib/l10n/app_*.arb
Languages: ro

# homePage
source: Alfie decks
ro: Alfie pachete

source: Deck market
ro: Market de pachete

# accountAndSettings
source: Account & Settings
ro: Cont & Setări

# noDecks
source: No decks saved
ro: Niciun pachet salvat

# createGroupTitle
source: Create a group for decks
ro: Creează un grup pentru pachetele de cartonașe

# editGroupTitle
source: Edit the group info
ro: Editează informațiile grupului

# groupNamePlaceholder
source: Group name..
ro: Numele grupului..

# groupNameError
source: Group' name is required!
ro: Numele grupului este obligatoriu!

# groupColorLabel
source: Group color
ro: Culoarea grupului

source: Close
ro: Închide

source: Cancel
ro: Anulează

source: Save
ro: Salvează

source: Confirm
ro: Confirmă

# addDeck
source: Create a deck
ro: Creează un pachet

# confirmationRequiredTitle
source: Confirmation required
ro: Confirmare necesară

# deleteGroupConfirmation
source: Are you sure you want to delete the group
ro: Ești sigur că vrei să ștergi grupul

# cantDeleteGroup
source: You can't delete a group with decks. Please move or delete the decks first.
ro: Nu poți șterge un grup care conține pachete de cartonașe. Mută-le în alt grup sau șterge-le mai întâi.

# errorLoadingDecks
source: There was an error while loading your decks.
ro: A apărut o eroare la încărcarea pachetelor de cartonașe. Te rugăm să încerci mai târziu.

# errorDeletingGroup
source: There was an error while deleting the group. Please try again later.
ro: A apărut o eroare la ștergerea grupului. Te rugăm să încerci mai târziu.

source: decks
ro: pachete

source: Create deck
ro: Creează un pachet

source: Edit deck
ro: Editează pachetul

# deckNamePlaceholder
source: Deck name..
ro: Numele pachetului..

# deckNameError
source: Deck's name is required!
ro: Numele pachetului este obligatoriu!

# deckDescriptionPlaceholder
source: Deck description..
ro: Descrierea pachetului..

# deckDescriptionError
source: Deck's description is required!
ro: Descrierea pachetului este obligatorie!

# createDeckExplanation
source: Create a deck to hold the cards you want to study. Make sure to give it a proper name and description to be better organized.
ro: Creează un pachet nou care să conțină cartonașele pe care vrei să le înveți. Asigură-te că alegi un nume și o descriere adecvată pentru a fi mai organizat.

# loadingDeckTitle
source: Loading deck..
ro: Se încarcă pachetul..

# deckNotFoundTitle
source: No deck
ro: Niciun pachet

# deckNotFoundMessage
source: Sorry, but there was a problem while trying to get the requestes deck's data. Please go back!
ro: Ne pare rău, dar a apărut o problemă la încărcarea pachetului solicitat. Te rugăm să încerci mai târziu.

# errorDeletingDeck
source: There was an error while deleting the deck. Please try again later.
ro: A apărut o eroare la ștergerea pachetului. Te rugăm să încerci mai târziu.

# deleteDeckConfirmation
source: Are you sure you want to delete this deck? All of the deck's cards will be deleted too.
ro: Sigur dorești să ștergi acest pachet? Cartonașele acestui pachet vor fi șterse.

# deleteDeckButton
source: Delete deck
ro: Șterge pachetul

# moveToOtherGroupButton
source: Move in other group
ro: Mută în alt grup

# studyDeckButton
source: Study deck
ro: Studiază pachetul

# addCardButton
source: Add card
ro: Adaugă un cartonaș

# editDeckInformationButton
source: Edit deck information
ro: Editează pachetul

source: Number of cards:
ro: Numărul de cartonașe:

source: Number of card reviews:
ro: Numărul de recenzii al cartonașelor:

source: Description:
ro: Descriere:

source: Choose a new group
ro: Alege un grup nou

# errorMovingDeckToGroup
source: There was an error while moving the deck to the new group. Please try again later.
ro: A apărut o problemă la mutarea pachetului în grupul selectat. Te rugăm să încerci mai târziu.

source: Create deck card
ro: Creează un cartonaș

source: Edit deck card
ro: Editează cartonașul

# showCardFaceButton
source: Show card's face
ro: Arată fața cartonașului

# showCardBackButton
source: Show card's back
ro: Arată spatele cartonașului

# changeDeckCardType
source: Change the type of the card
ro: Schimbă tipul cartonașului

# basicDeckCardDescription
source: Basic cards are the most common type of card. They have a question and an answer which will be revealed.
ro: Cartonașele Basic sunt cele mai comune. Ele au o întrebare și un răspuns care va fi dezvăluit.

# typeInDeckCardDescription
source: Type-in cards are cards that have a question and an answer like the basic ones. In addition you have to type what you think the answer is and then you can reveal the true answer and compare your results.
ro: Cartonașele Type-in sunt cartonașe care au o întrebare și un răspuns precum cele basic. În plus trebuie să scrii care crezi că este răspunsul și apoi poți să dezvălui adevăratul răspuns pentru a compara rezultatele.

# quizDeckCardDescription
source: Quiz cards are cards that have a question and multiple answers. You have to choose the correct answer.
ro: Cartonașele de tip Quizz sunt cartonașe care au o întrebare și variante de răspuns. Trebuie să alegi care crezi că este răspunsul corect.

# showEditCardFaceMenuButton
source: Edit card's face
ro: Editează fața cartonașului

# showPreviewCardFaceMenuButton
source: Preview card's face
ro: Vizualizează fața cartonașului

# writeCardQuestionHint
source: Write the question
ro: Scrie întrebarea

# writeCardAnswerHint
source: Write the answer
ro: Scrie răspunsul

source: Text format:
ro: Formatul textului:

source: Rendering...
ro: Procesare...

source: Time to answer:
ro: Timp de răspuns:

# timeToAnswerHelper
source: The time you have to answer the question. If you don't answer in time, the card will show the answer to you. A time of 0 means no time limit to answer.
ro: Timpul pe care îl ai la dispoziție pentru a răspunde la întrebare. Dacă nu răspunzi la timp, cartonașul va afișa răspunsul corect. Un timp de 0 înseamnă că nu există limită de timp pentru a răspunde.

source: Add an image
ro: Adaugă o imagine

source: Edit image
ro: Editează o imagine

source: Remove image
ro: Șterge imaginea

# imagePermissionRequiredMessage
source: You need to allow the app to access the camera and gallery to add an image to the card.
ro: Trebuie să permiți aplicației să acceseze camera și galeria pentru a adăuga imagini în cartonaș.

# storagePermissionRequiredMessage
source: You need to allow the app to access the storage to save media.
ro: Trebuie să permiți aplicației să acceseze spațiul de stocare pentru a salva conținut media.

# imagesNotSavedErrorMessage
source: The card images couldn't be saved.
ro: Imaginile cartonașului nu au putut fi salvate.

# removeAttachmentConfirmation
source: Are you sure you want to remove the attachment?
ro: Sigur dorești să ștergi atașamentul?

# numberOfOptions
source: No. answers
ro: Nr. răspunsuri

# correctAnswerIndex
source: Correct answer
ro: Răspunsul corect

# invalidDeckCardError
source: The card id is invalid
ro: Id-ul cartonașului este invalid.

# cardQuestionIsEmptyError
source: You need to provide a question for the card
ro: Trebuie să furnizezi o întrebare pentru cartonaș.

# questionAttachmentMissingError
source: There was a problem saving the question's attachment. Please remove it and try again.
ro: A apărut o problemă la salvarea atașamentului pentru întrebare. Te rugăm să-l elimini și să încerci din nou.

# cardAnswerIsEmptyError
source: You need to provide an answer for the card
ro: Trebuie să furnizezi un răspuns pentru cartonaș

# cardQuizMissingOptionsError
source: You need to select the options for the quiz
ro: Trebuie să selectezi opțiunile pentru quiz

# answerAttachmentMissingError
source: There was a problem saving the answer's attachment. Please remove it and try again.
ro: A apărut o problemă la salvarea atașamentului pentru răspuns. Te rugăm să-l elimini și să încerci din nou.

source: Loading study mode..
ro: Se încarcă modul de învățare..

source: Study mode
ro: Modul de învățare

# noCardsToStudy
source: There are no cards in this deck to study. Add some cards to start studying!
ro: Pachetul acesta nu conține cartonașe pentru a învăța. Adaugă câteva cartonașe pentru a începe să studiezi!

source: Show answer
ro: Arată răspunsul

# errorDeletingDeckCard
source: There was an error while deleting the card. Please try again later.
ro: A apărut o problemă la ștergerea cartonașului. Te rugăm să încerci mai târziu.

# deleteDeckCardConfirmation
source: Are you sure you want to delete this card? This action cannot be undone.
ro: Ești sigur că dorești să ștergi acest cartonaș? Această acțiune nu poate fi anulată.

source: Easy
ro: Ușor

source: Good
ro: Bine

source: Hard
ro: Greu

source: Write your answer here
ro: Scrie răspunsul tău aici

# imageMissingError
source: The image is missing from the local storage. Load a backup or edit this card to fix the problem.
ro: Imaginea lipsește din spațiul de stocare local. Încarcă un backup sau editează cartonașul pentru a rezolva această problemă.

source: Account
ro: Cont

source: Appearance
ro: Aspect

source: Backup and Storage
ro: Backup și Stocare

source: Statistics
ro: Statistici

# about
source: About Alfie
ro: Despre Alfie

source: Change language
ro: Schimbă limba

source: Change theme mode
ro: Schimbă modul temei

source: Change theme color
ro: Schimbă culoarea temei

source: How to use markdown?
ro: Cum să folosești Markdown?

source: What is this app?
ro: Ce este această aplicație?

source: Client source code
ro: Codul sursă al aplicației client

source: Cloud services source code
ro: Codul sursă al serviciilor cloud

# howToWriteMathInTex
source: How to write math equations in TeX
ro: Cum să scrii ecuații matematice în TeX?

source: How to use HTML
ro: Cum să folosești HTML?

# couldNotOpenLink
source: Could not open the link:
ro: Nu a putut fi deschis link-ul:

# appPurposeMessage
source: The app was designed for my license at the faculty. This app is meant to help you in self-studying. You can create decks of cards for multiple purposes and study them. You can also create groups of decks to better organize your decks. The app supports multiple text styling: simple, markdown, TeX, html with image supports. The app was designed with simplicity in mind and multiple customization to accommodate everyone's usecase.
ro: Aplicația a fost dezvoltată pentru licența mea la facultate. Aplicatia este gândită ca suport în învățare. Poți să creezi pachete de cartonașe pentru mai multe scopuri și să le înveți. Poți de asemenea să adaugi grupuri pentru a organiza mai bine pachetele. Aplicația suportă mai multe formate de text: simplu, markdown, TeX, html cu suport pentru imagini. Aplicția a fost gândită să fie simplă și multiple personalizări pentru a se potrivi pentru nevoile tuturor.

source: Terms of use and privacy policy
ro: Termeni de utilizare & confidențialitate

# termsOfUserAndPrivacyPolicyMessage
source: The app is open source (alongside the server side). It's released as free to use for anyone with or without an account. The app does not share you data with anyone.
ro: Aplicația este open source (împreună cu serverul). Este lansată ca fiind gratuit de folosit pentru orice cu sau fără un cont. Aplicația nu împărtășește datele tale cu nimeni.

source: Page not found
ro: Pagina nu a fost găsită

# pageNotFoundMessage
source: Sorry, we couldn't load the requested page. ðŸ˜”
ro: Ne pare rău, nu am putut găsi pagina cerută. 😔

source: Go home
ro: Du-te acasă.

# backupInfo
source: Cloud backup is optional and available only for users with accounts. You can still use the app and keep your self backups of data and media. Backup path:
ro: Backup-ul în cloud este opțional și disponibil numai pentru utilizatorii autentificați. Puteți încă să utilizați aplicația și să vă păstrați copii de siguranță singuri ale datelor și conținutului media. Locație backup:

source: Create local backup
ro: Creează backup local

source: Load local backup
ro: Încarcă backup local

source: Remove unused media
ro: Șterge atașamente nefolosite

source: Create cloud backup
ro: Creează backup în cloud

source: Load cloud backup
ro: Încarcă backup din cloud

# uploadCloudMedia
source: Upload cloud media & database
ro: Încarcă atașamentele & baza de date în cloud

source: Download cloud media
ro: Descarcă atașamentele din cloud

source: Remove unused cloud media
ro: Șterge atașamentele nefolosite din cloud

source: Remove reviews older than one week
ro: Șterge recenziile mai vechi de o săptămână

source: Remove reviews older than one month
ro: Șterge recenziile mai vechi de o lună

source: Remove reviews older than half a year
ro: Șterge recenziile mai vechi de jumătate de an

source: Remove reviews older than one year
ro: Șterge recenziile mai vechi de un an

# loadLocalBackupConfirmationMessage
source: Are you sure you want to load the local backup? This will overwrite your current data.
ro: Ești sigur că dorești să încarci un backup local? Această acțiune va suprascrie datele curente.

# successInCreatingLocalBackupFile
source: The database backup was successfully created. Check the file in the backup path
ro: Backup-ul bazei de date a fost creat cu success. Verifică fișierul în locațtia de backup.

# errorInRestoringDatabaseFromLocalBackup
source: There was an error while restoring the database from the local backup. Make sure you have placed the backup file alfie_backup.db inside the backup path.
ro: A apărut o eroare la restaurarea bazei de date din backup-ul local. Asigură-te ca ai încărcat fișierul de backup alfie_backup.db în locația de backup indicată.

# successInRestoringDatabaseFromLocalBackup
source: The database was successfully restored from the local backup.
ro: Baza de date a fost restaurată cu succes din backup-ul local.

# removeReviewsOlderThanOneWeekConfirmationMessage
source: Are you sure you want to remove the reviews older than one week? This action cannot be undone.
ro: Sigur dorești să elimini recenziile mai vechi de o săptămână? Această acțiune nu poate fi anulată.

# removeReviewsOlderThanOneMonthConfirmationMessage
source: Are you sure you want to remove the reviews older than one month? This action cannot be undone.
ro: Sigur dorești să elimini recenziile mai vechi de o lună? Această acțiune nu poate fi anulată.

# removeReviewsOlderThanHalfAYearConfirmationMessage
source: Are you sure you want to remove the reviews older than half a year? This action cannot be undone.
ro: Sigur dorești să elimini recenziile mai vechi de jumătate de an? Această acțiune nu poate fi anulată.

# removeReviewsOlderThanOneYearConfirmationMessage
source: Are you sure you want to remove the reviews older than one year? This action cannot be undone.
ro: Sigur dorești să elimini recenziile mai vechi de un an? Această acțiune nu poate fi anulată.

# successfullyRemovedReviews
source: The reviews were successfully removed.
ro: Recenziile au fost eliminate cu succes.

# errorInRemovingReviews
source: There was an error while removing the reviews. Please try again later.
ro: A apărut o problemă la eliminarea recenziilor. Te rugăm să încerci mai târziu.

# removeUnusedLocalMediaFilesConfirmation
source: Are you sure you want to remove unused media files? Alfie keeps the old media files you saved on your card in case you may want to reuse them. If storage usage is an issue remove the unused files.
ro: Sigur dorești să elimini fișierele media nefolosite? Alfie păstrează vechile fișiere media pe care le-ai folosit în cartonașe în cazul în care ai vrea să le refolosești. Dacă spațiul de stocare este o problemă, atunci șterge fișierele neutilizate.

# errorInRemovingUnusedLocalMediaFiles
source: There was an error while trying to remove the old, unused media files. Please try again
ro: A apărut o problemă la eliminarea fișierelor media nefolosite. Te rugăm să încerci mai târziu.

# successInRemovingUnusedLocalMediaFiles
source: The unused media files were successfully removed
ro: Fișierele media nefolosite au fost eliminate cu succes.

# userNotLoggedInToUserFeatureError
source: You need to be logged in order to use this feature!
ro: Trebuie să fii autentificat pentru a folosi această funcționalitate!

# errorWhileFetchingCardReviews
source: There was an error while fetching card reviews. Please try again later.
ro: A apărut o eroare la obținerea recenziilor cartonașului. Te rugăm să încerci mai târziu.

# selectTimelineFitlerForStatistics
source: Select the timeline filter for the statistics
ro: Selectează filtrul de timp pentru statistici

# ratingsForLastWeek
source: Ratings for the last week
ro: Evaluările pentru ultima săptămână

# ratingsForLastMonth
source: Ratings for the last month
ro: Evaluările pentru ultima lună

# ratingsForLastHalfYear
source: Ratings for the last half of the year
ro: Evaluările pentru ultima jumătate de an

source: Ratings for all reviews
ro: Evaluările pentru toate recenziile

# numberOfRatingsForLastWeek
source: Number of ratings for the last week
ro: Numărul de evaluări pentru ultima săptămână

# numberOfRatingsForLastMonth
source: Number of ratings for the last month
ro: Numărul de evaluări pentru ultima lună

# numberOfRatingsForLastHalfYear
source: Number of ratings for the last half of the year
ro: Numărul de evaluări pentru ultima jumătate de an

source: Number of ratings for all reviews
ro: Numărul de evaluări pentru toate recenziile

# timeToAnswerForRatingsForLastWeek
source: Answers times for ratings for the last week
ro: Timpii de răspuns pentru evaluările din ultima săptămână

# timeToAnswerForRatingsForLastMonth
source: Answers times for ratings for the last month
ro: Timpii de răspuns pentru evaluările din ultima lună

# timeToAnswerForRatingsForLastHalfYear
source: Answers times for ratings for the last half of the year
ro: Timpii de răspuns pentru evaluările din ultima jumătate de an

# timeToAnswerForRatingsForAllReviews
source: Answers times for ratings for all reviews
ro: Timpii de răspuns pentru evaluările din toate recenziile

source: Login
ro: Autentificare

source: Register
ro: Înregistrare

source: Don't have an account?
ro: Nu ai un cont?

source: Why use an account?
ro: De ce să folosești un cont?

# whyUseAnAccountReason
source: With an account you can backup your card's database and media to alfie cloud. With an accoun you will also get access to image to TeX option for cards. Plus you get access to more features to come.
ro: Cu un cont poti face backup pentru baza de date a cartonașelor și a conținutului media în cloud-ul Alfie. Cu un cont vei obtine access și la opțiunea de convertire a unei imagini în TeX pentru cartonașe. În plus, vei avea access la mai multe funcționalități care vor apărea.

source: Login to your account
ro: Connectează-te la contul tău

# invalidLoginForm
source: Invalid login form. Please check the fields.
ro: Formular de autentificare invalid. Te rugăm să verifici câmpurile.

source: Invalid email
ro: Email invalid

source: Password..
ro: Parolă..

# loginError
source: There was an error while logging in. Please try again later.
ro: A apărut o problemă la autentificare. Te rugăm să încerci mai târziu.

source: Create an account
ro: Creează un cont

source: First name..
ro: Prenume..

# invalidFirstName
source: First name should be at least 3 characters long.
ro: Prenumele ar trebui să aibă cel puțin 3 caractere.

source: Last name..
ro: Nume..

# invalidLastName
source: Last name should be at least 3 characters long.
ro: Numele ar trebui să aibă cel puțin 3 caractere.

# invalidPassword
source: The password should be at least 12 characters long, and have at least one uppercase letter, one lowercase letter, one number and one special character.
ro: Parola trebuie să fie de cel puțin 12 caractere și să conțină cel puțin o literă mare, o literă mică, un număr și un caracter special.

# emptyPassword
source: The password cannot be empty.
ro: Parola nu poate fi goală.

source: Confirm password..
ro: Confirmă parola..

# passwordsDoNotMatch
source: The passwords do not match.
ro: Parolele nu se potrivesc.

source: Already have an account?
ro: Ai deja un cont?

# invalidRegisterForm
source: Invalid register form. Please check the fields.
ro: Formular de înregistrare invalid. Te rugăm să verifici câmpurile.

source: Verify account
ro: Verifică contul

# reasonVerifyAccount
source: On registration we sent you an email with a verification code. Please enter that code below to verify your account.
ro: La înregistrare ți-am trimis un email cu un cod de verificare. Te rugăm să introduci acel cod mai jos pentru a-ți verifica contul.

source: Verification code..
ro: Cod de verificare..

source: Verify
ro: Verifică

# fillTheVerificationCode
source: Please fill the verification code.
ro: Te rugăm să introduci codul de verificare.

# resendVerificationCode
source: Resend user verification code
ro: Retrimite

# verifyUserError
source: There was an error while verifying your account. Please try again later.
ro: A apărut o problemă la verificarea contului. Te rugăm să încerci mai târziu.

# registerError
source: There was an error while registering. Please try again later.
ro: A apărut o problemă la înregistrare. Te rugăm să încerci mai târziu.

source: Resend code
ro: Retrimite codul

# resendVerifyUserCodeReason
source: If you didn't receive the verification code please fill the below form and we will send you a new one. If you still don't receive the email please check your spam folder.
ro: Dacă nu ai primit codul de verificare, te rugăm să introduci adresa de email mai jos și îți vom retrimite codul de verificare. Dacă tot nu ai primit email-ul, te rugăm să verifici folderul de spam.

# resendCodeError
source: There was an error while trying to resend the verification code. Please try again later.
ro: A apărut o problemă la retrimitea codului de verificare. Te rugăm să încerci mai târziu.

# login2FA
source: 2FA login
ro: Autentificare 2FA

# reasonLogin2FA
source: On login we sent you an email with a verification code. Please enter the code below to login.
ro: La autentificare ți-am trimis un email cu un cod de autentificare. Te rugăm să introduci acel cod mai jos pentru a te autentifica.

source: Resend login 2FA code
ro: Retrimite codul de autentificare 2FA

source: Account info
ro: Informații cont

source: Welcome back
ro: Bine ai revenit

source: Logout
ro: Deconectare

# logoutConfirmation
source: Are you sure you want to logout?
ro: Sigur vrei să te deconectezi?

source: Forgot your password?
ro: Ai uitat parola?

source: Update user info
ro: Actualizează informațiile contului

source: Change password
ro: Schimbă parola

source: Update password
ro: Actualizează parola

# enterYourEmailToResetYourPassword
source: Enter your email to reset your password. We will send you an email with a code to reset your password.
ro: Introdu adresa de email pentru a-ți reseta parola. Îți vom trimite un email cu un cod pentru a-ți reseta parola.

source: Send code
ro: Trimite codul

# forgotPasswordSendMailError
source: There was a problem while sending the email with the reset code. Please try again later.
ro: A apărut o problemă la trimiterea email-ului cu codul de resetare a parolei. Te rugăm să încerci mai târziu.

# forgotPasswordCodeSent
source: The email with the reset code was successfully sent. Please check your inbox.
ro: Email-ul cu codul de resetare a parolei a fost trimis cu succes. Te rugăm să verifici căsuța de email.

# invalidForm
source: Invalid form. Please check the fields.
ro: Formular invalid. Te rugăm să verifici câmpurile.

# resetPasswordError
source: There was an error while trying to reset your password. Please try again later.
ro: A apărut o problemă la resetarea parolei. Te rugăm să încerci mai târziu.

# passwordUpdatedSuccess
source: Your password was successfully updated.
ro: Parola ta a fost actualizată cu succes.

source: Reset password
ro: Resetează parola
