Repository: george-radu-cs/alfie-client
Catalog: lib/l10n/app_*.arb
Languages: ro

source: Update info
ro: Actualizează informațiile

# updateUserInfoError
source: There was an error while trying to update your info. Please try again later.
ro: A apărut o problemă la actualizarea informațiilor contului. Te rugăm să încerci mai târziu.

source: Your old password..
ro: Vechea ta parolă..

source: New password..
ro: Noua parolă..

source: Confirm new password..
ro: Confirmă noua parolă..

# updateUserInfoSuccessfully
source: Your info was successfully updated.
ro: Informațiile tale au fost actualizate cu succes.

# convertImageToTex
source: Image to TeX
ro: Imagine -> TeX

# imageToConvertNotProvidedMessage
source: You need to provide an image to be converted to TeX.
ro: Trebuie să încarci o imagine pentru a o converti în TeX.

# couldNotProcessImageMessage
source: There was an error while processing the image. Please try again later.
ro: A apărut o problemă la procesarea imaginii. Te rugăm să încerci mai târziu.

# doNotShowThisMessageAgain
source: Don't show this message again
ro: Nu mai afișa acest mesaj

# errorConvertImageToTex
source: There was an error while trying to convert the image to TeX. Please try again later.
ro: A apărut o problemă la convertirea imaginii în TeX. Te rugăm să încerci mai târziu.

# convertImageToTextConfirmation
source: You are going to convert an image to formatted text. This feature uses an OCR to make the conversion, so it might not be 100% accurate. But you can always edit the text computed afterwards to fix small errors. Also this may take a little time to process the image, so please don't close the page. To achieve better results and rapid conversions please crop the image to keep only the part you want to convert.
ro: Urmează să convertești o imagine în TeX. Această funcționalitate folosește un OCR pentru a face conversia, așă că este posibil să nu fie 100% precisă. Dar poți oricând să editezi rezultatul pentru a corecta micile erori. De asemenea, procesarea imaginii poate dura puțin timp, așă că te rugăm să nu închizi pagina. Pentru a obține rezultate mai bune și conversii rapide, decupează imaginea pentru a păstra doar partea pe dorești să o convertești.

# uploadDatabaseToCloudError
source: There was an error while uploading the database to cloud. Please try again later.
ro: A apărut o problemă la salvarea bazei de date în cloud. Te rugăm să încerci mai târziu.

# loadDatabaseFromCloudError
source: There was an error while loading the database from cloud. Please try again later.
ro: A aprăut p problemă la descărcarea bazei de date din cloud. Te rugăm să încerci mai târziu.

# uploadDatabaseToCloudSuccessfully
source: The database was successfully uploaded to the cloud.
ro: Baza de date a fost salvată cu succes în cloud.

# loadDatabaseFromCloudSuccessfully
source: The database was successfully loaded from the cloud.
ro: Baza de date a fost descărcată cu success din cloud.

# uploadMediaToCloudSuccessfully
source: The media was successfully uploaded to the cloud.
ro: Conținutul media a fost încarcat cu succes în cloud.

# uploadMediaToCloudError
source: There was an error while uploading the media to cloud. Please try again later.
ro: A apărut o problemă la salvarea conținutului media în cloud. Te rugăm să încerci mai târziu.

# downloadMediaFromCloudSuccessfully
source: The media was successfully downloaded from the cloud.
ro: Conținutul media a fost descărcat cu success din cloud.

# downloadMediaFromCloudError
source: There was an error while downloading the media from cloud. Please try again later.
ro: A apărut o problemă la descărcarea conținutului media din cloud. Te rugăm să încerci mai târziu.

# removeUnusedMediaFromCloudSuccessfully
source: The unused media was successfully removed from the cloud.
ro: Conținutul media nefolosit a fost șters cu succes din cloud.

# removeUnusedMediaFromCloudError
source: There was an error while removing the unused media from cloud. Please try again later.
ro: A apărut o problemă la ștergerea conținutului media nefolosit din cloud. Te rugăm să încerci mai târziu.

# loadCloudBackupConfirmationMessage
source: You are going to load a backup from the cloud. This will overwrite your current database. Are you sure you want to continue?
ro: Urmează să descarci o copie de rezervă a bazei de date din cloud. Această acțiune va suprascrie baza de date curentă. Ești sigur că vrei să continui?

# usingMobileDataConfirmationMessage
source: You are going to use mobile data for this action. This will increase your mobile data usage and may lead to additional charges. We recommend doing this only on Wi-Fi. Are you sure you want to continue using mobile data?
ro: Urmează să folosești datele mobile pentru această acțiune. Acest lucru va crește utilizarea datelor mobile și poate duce la costuri suplimentare. Îți recomandăm să faci acest lucru numai conectat la Wi-Fi. Ești sigur că vrei să continui pe date mobile?

# mediaFilesAlreadySyncedWithCloud
source: The media files are already synced with the cloud.
ro: Conținutul media este deja sincronizat cu cloud-ul.
